{
  "action.skipOnboarding": "Skip onboarding",
  "action.next": "Next",
  "action.back": "Back",
  "action.finish": "Finish",

  "dismissable_rag_modal": {
    "description": "You can now chat with your own documents using Retrieval Augmented Generation (RAG). Here's how it works:",
    "instructions": {
      "attach_files": {
        "title": "Attach Files",
        "description": "Upload up to 5 files at a time, with a maximum combined size of 30MB. Supported formats include PDF, DOCX, TXT, and CSV."
      },
      "be_specific": {
        "title": "Be Specific",
        "description": "When asking questions, mention as many details as possible. This helps the system retrieve the most relevant information from your documents."
      },
      "get_responses": {
        "title": "Get Responses and Experiment",
        "description": "The LLM will look at your query and the retrieved excerpts from your documents, and attempt to generate a response. Experiment with different queries to find what works best."
      }
    }
  },

  "toolUse": {
    "step_0": {
      "title": "Tool use has landed! 🛠️",
      "text_0": "Tool use enable applications to empower LLMs with external tools and services. You can think of it like giving the LLM a toolbox of functions it can use when needed.",
      "text_1": "With tool use, you can build applications where LLMs not only understand and respond, but take actions - like searching the web, analyzing data, controlling smart home devices, or interacting with any API.",
      "text_2": "The possibilities are endless - if you can write a function for it, an LLM can intelligently use it."
    },
    "step_1": {
      "title": "How do I get started?",
      "toolUseCanWorkWithAnyModel": "All models are compatible with tool use in LM Studio. However, models with `native` tool use support will generally perform better. Read the <customlink>documentation</customlink> to learn more. These models will be marked with a new badge:",
      "hasCompatibleModel": "You have models with `native` support already downloaded! Select one to get started:",
      "downloadRecommendedModel": "Download your first `native` tool use model:"
    },
    "nextButton": "Next",
    "letsGoButton": "Let's go"
  }
}
