{
  "action.skipOnboarding": "Пропустить ознакомление",
  "action.next": "Далее",
  "action.back": "Назад",
  "action.finish": "Готово",

  "dismissable_rag_modal": {
    "description": "Теперь вы можете общаться со своими документами с помощью технологии Retrieval Augmented Generation (RAG). Вот как это работает:",
    "instructions": {
      "attach_files": {
        "title": "Прикрепить файлы",
        "description": "Загрузите до 5 файлов одновременно, общий размер которых не превышает 30 МБ. Поддерживаемые форматы включают PDF, DOCX, TXT и CSV."
      },
      "be_specific": {
        "title": "Будьте конкретны",
        "description": "Когда задаёте вопросы, указывайте как можно больше подробностей. Это поможет системе извлекать наиболее релевантную информацию из ваших документов."
      },
      "get_responses": {
        "title": "Получайте ответы и экспериментируйте",
        "description": "LLM проанализирует ваш запрос и извлечённые фрагменты ваших документов, а затем попытается сгенерировать ответ. Экспериментируйте с различными запросами, чтобы найти наилучший результат."
      }
    }
  },

  "toolUse": {
    "step_0": {
      "title": "Бета: Использование инструментов 🛠️ (Вызов функций)",
      "text_0": "Некоторые модели (например, Llama 3.1/3.2, Mistral, Qwen и другие) были обучены использовать инструменты.",
      "text_1": "На практике это означает следующее: вы передаёте LLM массив 'инструментов' (сигнатур функций) в строго определённом формате, и модель сама решает, нужно ли их вызывать, основываясь на промпте пользователя.",
      "text_2": "Вы можете представить такие сценарии использования, как запрос к API, запуск кода или что угодно, что можно описать в виде вызова функции."
    },
    "step_1": {
      "title": "Начните работу с инструментами",
      "toolUseCanWorkWithAnyModel": "Модели, обученные использованию инструментов, будут работать лучше других, но вы можете попробовать использовать их с любой моделью. Ознакомьтесь с <customlink>документацией</customlink>, чтобы узнать больше.\nМодели, обученные использованию инструментов, будут отмечены новым значком:",
      "hasCompatibleModel": "🎉 Кажется, у вас уже есть модели с поддержкой инструментов!",
      "downloadRecommendedModel": "Загрузите модель, обученную использованию инструментов:"
    },
    "nextButton": "Далее",
    "letsGoButton": "Загрузить модель и запустить сервер",
    "doneButton": "Закрыть"
  }
}
