{
  "action.skipOnboarding": "Παράλειψη εισαγωγής",
  "action.next": "Επόμενο",
  "action.back": "Πίσω",
  "action.finish": "Τέλος",

  "dismissable_rag_modal": {
    "description": "Τώρα μπορείτε να συνομιλείτε με τα δικά σας έγγραφα χρησιμοποιώντας την Ενισχυμένη Ανάκτηση Γενιάς (RAG). Δείτε πώς λειτουργεί:",
    "instructions": {
      "attach_files": {
        "title": "Επισύναψη Αρχείων",
        "description": "Ανεβάστε έως 5 αρχεία τη φορά, με μέγιστο συνδυασμένο μέγεθος 30MB. Υποστηριζόμενες μορφές περιλαμβάνουν PDF, DOCX, TXT και CSV."
      },
      "be_specific": {
        "title": "Να Είστε Συγκεκριμένοι",
        "description": "Όταν κάνετε ερωτήσεις, αναφέρετε όσο το δυνατόν περισσότερες λεπτομέρειες. Αυτό βοηθά το σύστημα να ανακτήσει τις πιο σχετικές πληροφορίες από τα έγγραφά σας."
      },
      "get_responses": {
        "title": "Λάβετε Απαντήσεις και Πειραματιστείτε",
        "description": "Το LLM θα εξετάσει το ερώτημά σας και τα ανακτημένα αποσπάσματα από τα έγγραφά σας, και θα προσπαθήσει να δημιουργήσει μια απάντηση. Πειραματιστείτε με διαφορετικά ερωτήματα για να βρείτε τι λειτουργεί καλύτερα."
      }
    }
  },

  "toolUse": {
    "step_0": {
      "title": "Beta: Χρήση Εργαλείων 🛠️ (Κλήση Συνάρτησης)",
      "text_0": "Ορισμένα μοντέλα (π.χ. Llama 3.1/3.2, Mistral, Qwen και άλλα) εκπαιδεύτηκαν για να χρησιμοποιούν εργαλεία.",
      "text_1": "Τι σημαίνει αυτό στην πράξη: παρέχετε έναν πίνακα 'εργαλείων' (υπογραφές συναρτήσεων) στο LLM σε μια πολύ συγκεκριμένη μορφή, και το LLM μπορεί να αποφασίσει εάν θα τα 'καλέσει' με βάση την προτροπή του χρήστη.",
      "text_2": "Μπορείτε να φανταστείτε περιπτώσεις χρήσης όπως η αναζήτηση σε ένα API, η εκτέλεση κώδικα, ή πραγματικά οτιδήποτε μπορεί να εκφραστεί ως κλήση συνάρτησης."
    },
    "step_1": {
      "title": "Ξεκινήστε με τη Χρήση Εργαλείων",
      "toolUseCanWorkWithAnyModel": "Τα μοντέλα που εκπαιδεύτηκαν για χρήση εργαλείων θα λειτουργούν καλύτερα από άλλα, αλλά μπορείτε να δοκιμάσετε να χρησιμοποιήσετε εργαλεία με οποιοδήποτε μοντέλο. Διαβάστε την <customlink>τεκμηρίωση</customlink> για να μάθετε περισσότερα.\nΤα μοντέλα που εκπαιδεύτηκαν για χρήση εργαλείων θα σημαίνονται με ένα νέο σήμα:",
      "hasCompatibleModel": "🎉 Φαίνεται ότι έχετε ήδη μοντέλα με υποστήριξη εργαλείων!",
      "downloadRecommendedModel": "Κατεβάστε ένα μοντέλο που εκπαιδεύτηκε για χρήση εργαλείων:"
    },
    "nextButton": "Επόμενο",
    "letsGoButton": "Φόρτωση μοντέλου και εκκίνηση διακομιστή",
    "doneButton": "Απόρριψη"
  }
}
