{
  "action.skipOnboarding": "Saltar-se la introducció",
  "action.next": "Següent",
  "action.back": "Anterior",
  "action.finish": "Acabar",

  "dismissable_rag_modal": {
    "description": "Ara pots xatejar amb els teus documents utilitzant la Generació Augmentada per Recuperació (RAG). Aixís funciona:",
    "instructions": {
      "attach_files": {
        "title": "Adjunta fitxers",
        "description": "Puja fins a 5 per cop, amb un pes màxim combinat de 30MB. Els fitxers suportats són PDF, DOCX, TXT, i CSV."
      },
      "be_specific": {
        "title": "Sigues Específic",
        "description": "En fer preguntes, menciona tots els detalls possibles. Això ajudarà al sistema a recuperar la informació més rellevant dels teus documents."
      },
      "get_responses": {
        "title": "Obtén Respostes i Experimenta",
        "description": "El LLM mirarà la teva pregunta i cercarà als extractes recuperats dels teus documents, provant de generar una resposta. Experimenta amb diferents preguntes fins obtenir la millor resposta."
      }
    }
  },

  "toolUse": {
    "step_0": {
      "title": "Beta: Ús d'Eina 🛠️ (Function Calling)",
      "text_0": "Alguns models (p. e. Llama 3.1/3.2, Mistral, Qwen i d'altres) han estat entrenats per fer ús com eina.",
      "text_1": "Què significa això? Tu dones un seguit de d'usos com eina (function signatures) al LLM en un format en particular i el LLM podrà decidir si 'trucar-les' basant-se en el prompt de l'usuari.",
      "text_2": "You can imagine use cases such as querying an API, running code, or really anything that can be expressed as a function call."
    },
    "step_1": {
      "title": "Possa't en marxa amb l'Ús com Eina",
      "toolUseCanWorkWithAnyModel": "Els models entrenats per ús com a eina tindran un millor rendiment que altres, però pots provar d'utilitzar l'ús com eina amb qualsevol model. Llegeix la <customlink>documentació</customlink> per aprendre més.\nEls models que han estat entrenats per ser utilitzats amb 'tool' es marcaran amb una nova icona:",
      "hasCompatibleModel": "🎉 Sembla que ja tens models que suporten l'ús com eina!",
      "downloadRecommendedModel": "Descarrega un model que hagi estat entrenat per ús com eina:"
    },
    "nextButton": "Següent",
    "letsGoButton": "Carrega el model i inicia el servidor",
    "doneButton": "Ignorar"
  }
}
