{
  "action.skipOnboarding": "Прапусціць адаптацыю",
  "action.next": "Далей",
  "action.back": "Назад",
  "action.finish": "Скончыць",

  "dismissable_rag_modal": {
    "description": "Цяпер вы можаце камунікаваць са сваімі дакументамі праз Retrieval Augmented Generation (RAG). Вось як гэта працуе:",
    "instructions": {
      "attach_files": {
        "title": "Далучыце файлы",
        "description": "Загрузіце да 5 файлаў за раз, памерам да 30 МБ разам. Падтрыманыя фарматы: PDF, DOCX, TXT і CSV."
      },
      "be_specific": {
        "title": "Будзьце дакладныя",
        "description": "Калі задаяце пытанне, дайце як мага больш дэталяў. Гэта дапаможа сістэме атрымаць найрэлевантную інфармацыю з вашых дакументаў."
      },
      "get_responses": {
        "title": "Атрымвайце адказы і эксперыментуйце",
        "description": "LLM прааналізуе ваш запыт і фрагменты, атрыманыя з дакументаў, і паспрабуе стварыць адказ. Эксперыментуйце з рознымі запытамі, каб знайсці той, што працуе найлепш."
      }
    }
  },

  "toolUse": {
    "step_0": {
      "title": "Бэта: Ужыванне інструментаў 🛠️ (Выклік функцыяў)",
      "text_0": "Ёсць мадэлі (прыкладам, Llama 3.1/3.2, Mistral, Qwen і іншыя) навучаныя карыстацца інструментамі.",
      "text_1": "На практыцы гэта азначае, што вы даеце масіў «інструментаў» (апісанні функцый) у пэўным фармаце, і LLM можа меркаваць, ці 'выклікаць' іх на запыт карыстача.",
      "text_2": "Можна уявіць сабе сцэнары выкарыстання, такія як запыт да API, выкананне кода ці нешта іншае, што можна падаць як выклік функцыі."
    },
    "step_1": {
      "title": "Пачніце выкарыстанне інструментаў",
      "toolUseCanWorkWithAnyModel": "Мадэлі, навучаныя для працы з інструментамі, будуць паказваць лепшыя вынікі, але ты можаш паспрабаваць ужыць інструменты з кожнай мадэллю. Больш інфармацыі глядзіце ў <customlink>дакументацыі</customlink>.\nМадэлі, навучаныя працаваць з інструментамі, пазначаюцца новым цэтлікам:",
      "hasCompatibleModel": "🎉 Здаецца, ў вас ужо ёсць мадэлі з падтрымкай інструментаў!",
      "downloadRecommendedModel": "Спампуйце мадэль, навучаную працаваць з інструментамі:"
    },
    "nextButton": "Далей",
    "letsGoButton": "Загрузіць мадэль і запусціць сервер",
    "doneButton": "Закрыць"
  }
}
