{
  "action.skipOnboarding": "Пропустить введение",
  "action.next": "Далее",
  "action.back": "Назад",
  "action.finish": "Завершить",

  "dismissable_rag_modal": {
    "description": "Теперь вы можете общаться с вашими собственными документами с использованием Retrieval Augmented Generation (RAG). Вот как это работает:",
    "instructions": {
      "attach_files": {
        "title": "Прикрепите файлы",
        "description": "Загрузите до 5 файлов за раз, с максимальным совокупным размером 30 МБ. Поддерживаемые форматы включают PDF, DOCX, TXT и CSV."
      },
      "be_specific": {
        "title": "Будьте конкретны",
        "description": "При задавании вопросов указывайте как можно больше деталей. Это поможет системе извлечь наиболее релевантную информацию из ваших документов."
      },
      "get_responses": {
        "title": "Получайте ответы и экспериментируйте",
        "description": "LLM будет анализировать ваш запрос и извлеченные из ваших документов фрагменты, и пытаться сгенерировать ответ. Экспериментируйте с различными запросами, чтобы найти наилучший результат."
      }
    }
  },

  "toolUse": {
    "step_0": {
      "title": "Бета: Использование инструментов 🛠️ (Вызов функций)",
      "text_0": "Некоторые модели (например, Llama 3.1/3.2, Mistral, Qwen и другие) обучены использовать инструменты.",
      "text_1": "Это означает, что вы предоставляете массив 'инструментов' (подписи функций) LLM в очень определенном формате, и LLM может решить, следует ли ему 'вызвать' их на основе запроса пользователя.",
      "text_2": "Можно представить себе сценарии использования, такие как запрос к API, выполнение кода или что-либо другое, которое можно выразить в виде вызова функции."
    },
    "step_1": {
      "title": "Начните использовать инструменты",
      "toolUseCanWorkWithAnyModel": "Модели, обученные для использования инструментов, будут работать лучше других, но вы можете попробовать использовать инструменты с любой моделью. Прочитайте <customlink>документацию</customlink>, чтобы узнать больше. Модели, обученные для использования инструментов, будут отмечены новым значком:",
      "hasCompatibleModel": "🎉 Кажется, у вас уже есть модели с поддержкой инструментов!",
      "downloadRecommendedModel": "Скачайте модель, обученную для использования инструментов:"
    },
    "nextButton": "Далее",
    "letsGoButton": "Загрузить модель и запустить сервер",
    "doneButton": "Закрыть"
  }
}
